In [7]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('display.precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [14]:
dat = {
    "author": pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll']),
    "book_title": pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland']),
    "user1": pd.Series(data = [3.2, np.nan ,2.5]),
    "user2": pd.Series(data = [5., 1.3, 4.0, 3.8]),
    "user3": pd.Series(data = [2.0, 2.3, np.nan, 4]),
    "user4": pd.Series(data = [4, 3.5, 4, 5, 4.2])
}

In [16]:
book_ratings = pd.DataFrame(dat)

In [18]:
book_ratings

                author           book_title  user1  user2  user3  user4
0      Charles Dickens   Great Expectations    3.2    5.0    2.0    4.0
1       John Steinbeck      Of Mice and Men    NaN    1.3    2.3    3.5
2  William Shakespeare     Romeo and Juliet    2.5    4.0    NaN    4.0
3          H. G. Wells     The Time Machine    NaN    3.8    4.0    5.0
4        Lewis Carroll  Alice in Wonderland    NaN    NaN    NaN    4.2

In [31]:
slice = book_ratings[["user1", "user2", "user3", "user4"]]

In [33]:
slice

   user1  user2  user3  user4
0    3.2    5.0    2.0    4.0
1    NaN    1.3    2.3    3.5
2    2.5    4.0    NaN    4.0
3    NaN    3.8    4.0    5.0
4    NaN    NaN    NaN    4.2

In [35]:
avg_col = np.mean(slice, axis = 0)

In [37]:
avg_col

user1    2.9
user2    3.5
user3    2.8
user4    4.1
dtype: float64

In [47]:
final = book_ratings.fillna(avg_col)

In [49]:
final

                author           book_title  user1  user2  user3  user4
0      Charles Dickens   Great Expectations    3.2    5.0    2.0    4.0
1       John Steinbeck      Of Mice and Men    2.9    1.3    2.3    3.5
2  William Shakespeare     Romeo and Juliet    2.5    4.0    2.8    4.0
3          H. G. Wells     The Time Machine    2.9    3.8    4.0    5.0
4        Lewis Carroll  Alice in Wonderland    2.9    3.5    2.8    4.2